Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.EndSymbols Enumeration
 The shape of the bar ends in the pull-out.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EndSymbols
Public Enumeration EndSymbols
Members
Member name | Value | Description
NONE | 1 |  Obsolete.  No end symbols.
None | 1 |  No end symbols.
SINGLE | 2 |  Obsolete.  A single end symbol arrow.
Single | 2 |  A single end symbol arrow.
BOTH | 3 |  Obsolete.  An arrow to both directions.
Both | 3 |  An arrow to both directions.
See Also
Reference
Tekla.Structures.Drawing Namespace